# https://github.com/Homebrew/homebrew-bundle

# -----------------------------------------------------------------------------
# Settings
# -----------------------------------------------------------------------------

# Define where to put installed applications
cask_args appdir: '/Applications'

# Allow installation of AppStore applications
brew 'mas'

# -----------------------------------------------------------------------------
# Applications to install
# -----------------------------------------------------------------------------

# Network
brew 'curl'
brew 'dnsmasq', restart_service: true
brew 'openssh'
brew 'openssl'
brew 'openvpn'
brew 'rsync'
brew 'wget'

# Terminal
brew 'starship'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
cask 'iterm2'

# Misc utilities
cask 'bitwarden'
cask 'deepl'
cask 'maccy' # Clipboard manager
cask 'rectangle' # Window manager

# Web
cask 'firefox'
cask 'google-chrome'

# Development
brew 'git'
brew 'node'
brew 'nvm'
brew 'pnpm'
brew 'commitizen'
# https://github.com/tonsky/FiraCode/wiki#installing-font
cask 'font-fira-code'
# https://github.com/ryanoasis/nerd-fonts#option-4-homebrew-fonts
cask 'font-hack-nerd-font'
cask 'github'
cask 'visual-studio-code'


# Videos
brew 'ffmpeg'
cask 'vlc'

# Communication
mas 'Slack', id: 803453959

